Revit 2027 API
TaskDialog.FooterText Property
 FooterText is used in the footer area of the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FooterText { get; set; }
Public Property FooterText As String
	Get
	Set
public:
property String^ FooterText {
	String^ get ();
	void set (String^ value);
}
member FooterText : string with get, set
Property Value
String
Remarks
 HTML Hyperlink tags can be used when specifying Footertext. These will work like normal hyperlinks where clicking them will launch the default browser to the location specified. Revit special cases hyperlinks containing the following:
 single character '#' to indicate to launch Revit's contextual help for the dialog. The Topic passed for the contextual help takes the form H[id] where id is the Id for the task dialog.
 string of the form 'rvthelptopic:[Topic]' to indicate to launch Revit's contextual help for the topic specified. If topic is omitted, it is treated the same as if '#' was specified instead.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace